read_verilog mux4x14b.v
hierarchy -check -top mux4x14b
proc; opt; fsm; opt; memory; opt
techmap; opt 
dfflibmap -liberty cmos_cells.lib
abc -liberty cmos_cells.lib
clean
write_verilog mux4x14bSynth.v