read_verilog fifoMod.v
hierarchy -check -top fifoMod
proc; opt; fsm; opt; memory; opt
techmap; opt 
dfflibmap -liberty cmos_cells.lib
abc -liberty cmos_cells.lib
clean
write_verilog fifoModSynth.v