read_verilog FSM.v
hierarchy -check -top FSM
proc; opt; fsm; opt; memory; opt
techmap; opt 
dfflibmap -liberty cmos_cells.lib
abc -liberty cmos_cells.lib
clean
write_verilog FSM_Synth.v
