read_verilog arbitro2.v
hierarchy -check -top arbitro2
proc; opt; fsm; opt; memory; opt
techmap; opt 
dfflibmap -liberty cmos_cells.lib
abc -liberty cmos_cells.lib
clean
write_verilog arbitro2Synth.v