read_verilog muxmemoriaconductual.v
hierarchy -check -top muxmemoriaconductual
proc; opt; fsm; opt; memory; opt
techmap; opt 
dfflibmap -liberty cmos_cells.lib
abc -liberty cmos_cells.lib
clean
write_verilog mux2x1Synth.v