read_verilog muxmemoriaconductual.v
hierarchy -check -top mux_mem_conductual
proc; opt; fsm; opt; memory; opt
techmap; opt 
dfflibmap -liberty cmos_cells.lib
abc -liberty cmos_cells.lib
clean
write_verilog estructural2.v